app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE (2) LIMIT ?  [["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      if Artist.find_by(params[:artist_id])
      @songs = Artist.find(params[:artist_id]).songs
      else
        flash[:alert] = "Artist not found"
        redirect_to 'artists/index'
      end
    end
    @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE (2) LIMIT ?  [["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if Song.find_by(params[:id]) != nil
      @song = Song.find(params[:id])